{
    "app": {
      "sections": [
        { "label": "Vítejte" },
        { "label": "O Mně" },
        { "label": "Tech Stack" },
        { "label": "Zkušenosti & Vzdělání" },
        { "label": "Vybrané Projekty" },
        { "label": "Pojďme Spolupracovat" }
      ],
      "scrollIndicatorText": "Vítejte! Jsem Fanda."
    },
    "appTexts": {
      "ledMatrixText": "Vítejte, Fanda",
      "scrollIndicators": [
        "Ahoj! Jsem Fanda."
      ]
    },
    "cards": [
      {
        "title": "O mně",
        "description": "Jmenuji se František Peterka je mi 23 let. Jsem IT specialista a vývojář webových aplikací."
      },
      {
        "title": "Frontend",
        "description": "Vytvářím responzivní uživatelská rozhraní s využitím React a Next.js"
      },
      {
        "title": "Backend",
        "description": "Vyvíjím bezpečné a škálovatelné backendy pomocí Node.js, Express.js a MongoDB."
      },
      {
        "title": "Web",
        "description": "Věnuji se převážně prostředí webových aplikací."
      },
      {
        "title": "Student",
        "description": "Studuji softwarový vývoj a rád se učím nové technologie."
      },
      
      {
        "title": "IT",
        "description": "Mám praxi ve správě windows systémů, síťové administraci a automatizaci."
      }
    ],
    "contactForm": {
      "labels": {
        "name": "Jméno",
        "email": "Email",
        "message": "Zpráva"
      },
      "placeholders": {
        "name": "Vaše jméno",
        "email": "Váš email",
        "message": "Vaše zpráva"
      },
      "feedback": {
        "success": "Email byl úspěšně odeslán!",
        "errorPrefix": "Chyba při odesílání emailu: "
      }
    },
    "footer": {
      "copyright": "© 2025 František Peterka. Všechna práva vyhrazena."
    },
    "scrollIndicator": {
      "defaultText": "Posuňte dolů"
    },
    "navbar": {
      "brandIcon": "/developer.png",
      "brandText": "Fanda",
      "brandSubText": "JS Vývojář",
      "separator": ">>>"
    },
    "projects": [
      {
        "name": "List Management App",
        "description": "Komplexní řešení pro správu seznamů a databází. Aplikace nabízí správu seznamů, možnost vytváření a editace položek, filtrování a statistiky."
      },
      {
        "name": "PowerShell Scripting",
        "description": "Tento projekt využívá skriptování PowerShell pro automatizaci."
      },
      {
        "name": "BoostApp",
        "description": "Moje první webová aplikace, na které jsem se učil základy webového vývoje."
      }
    ],
    
  "tech": {
    "0": {
      "title": "CSS",
      "description": "Používám pokročilé techniky CSS (Flexbox, Grid, animace) pro tvorbu responzivních, moderních a esteticky přitažlivých webových designů, které zajišťují skvělou uživatelskou zkušenost napříč zařízeními."
    },
    "1": {
      "title": "Three.js",
      "description": "S využitím Three.js vytvářím interaktivní 3D vizualizace a animace přímo ve webovém prohlížeči, což obohacuje webové stránky o dynamické a poutavé 3D prvky."
    },
    "2": {
      "title": "Figma",
      "description": "Ve Figmě navrhuji moderní uživatelská rozhraní a interaktivní prototypy, podporuji týmovou spolupráci a vytvářím vizuálně atraktivní designy, které reflektují aktuální trendy v UI/UX."
    },
    "3": {
      "title": "Git",
      "description": "S Gitem efektivně spravuji verze kódu, spolupracuji v týmech a udržuji historii projektu, což zajišťuje plynulý vývoj a bezpečné nasazení software."
    },
    "4": {
      "title": "HTML",
      "description": "Tvořím semanticky správné a přístupné webové stránky pomocí HTML, čímž zlepšuji SEO a zajistuji konzistentní strukturu obsahu pro vyhledávače i uživatele."
    },
    "5": {
      "title": "JavaScript",
      "description": "JavaScript využívám pro vytváření dynamických a interaktivních webových aplikací, kde ovládám jak základní, tak pokročilé koncepty pro plynulý a responzivní vývoj."
    },
    "6": {
      "title": "MongoDB",
      "description": "Navrhuji flexibilní a výkonná NoSQL databázová řešení s MongoDB, která umožňují efektivní správu rozsáhlých datových sad a snadnou škálovatelnost aplikací."
    },
    "7": {
      "title": "Node.js",
      "description": "Díky Node.js vytvářím robustní a škálovatelné backendy a API, které podporují rychlou komunikaci mezi klientem a serverem a zajišťují vysoký výkon webových aplikací."
    },
    "8": {
      "title": "React",
      "description": "S Reactem navrhuji moderní a dynamické frontendové aplikace využívající komponentový přístup, což usnadňuje správu stavu a vývoj interaktivního uživatelského rozhraní."
    },
    "9": {
      "title": "PowerShell",
      "description": "PowerShell využívám jako skriptovací nástroj pro automatizaci administrativních úloh a správu systémů, zejména v prostředí Windows, což výrazně zefektivňuje provoz a údržbu IT infrastruktury."
    },
    "10": {
      "title": "Next.js",
      "description": "Next.js je framework pro React, který umožňuje server-side rendering a generování statických stránek. Díky tomu vytvářím rychlé, SEO optimalizované webové aplikace s lepší uživatelskou zkušeností."
    },
    "11": {
      "title": "TypeScript",
      "description": "S TypeScriptem rozšiřuji možnosti JavaScriptu o statické typování, což zvyšuje bezpečnost kódu, usnadňuje údržbu a minimalizuje runtime chyby v aplikacích."
    }
  },
    "experiences": {
      "0": {
        "title": "Unicorn University",
        "name": "Unicorn University",
        "description": "Studuji softwarový vývoj se zaměřením na moderní vývoj webových aplikací.",
        "date": "2023 - 2026",
        "skills": ["#JavaScript", "#TypeScript","#Node.js" , "#Design", "#HTML", "#CSS", "#React", "#SQL", "#MongoDB", "#NodeRED", "#Agile", "#Business English"]
      },
      "1": {
        "title": "IT Specialista",
        "name": "IT Specialista",
        "description": "IT specialista působící v armádním prostředí, zaměřený na správu systémů a sítí.",
        "date": "2023 - Přítomnost",
        "skills": ["#Windows", "#Síťová Infrastruktura", "#Windows Server","#PowerShell", "#Simulace", "#Vzdálená Správa"]
      },
      "2": {
        "title": "Univerzita obrany",
        "name": "Univerzita obrany",
        "description": "Studoval jsem elektrotechniku (elektroniku, matematika, fyzika). Během tří semestrů jsem dosahoval výborných výsledků (ekvivalent GPA 4.0). Ve čtvrtém semestru jsem studium ze zdravotních důvodů ukončil.",
        "date": "2021 - 2023",
        "skills": ["#Matematika", "#Fyzika", "#Elektrotechnika"]
      }
    }
  }