{
  "app": {
    "sections": [
        { "label": "Welcome" },
        { "label": "About Me" },
        { "label": "Tech Stack" },
        { "label": "Experience & Education" },
        { "label": "Highlighted Projects" },
        { "label": "Let's Work Together" }
    ],
    "scrollIndicatorText": "Welcome! I'm Fanda."
  },
  "appTexts": {
    "ledMatrixText": "Welcome, Fanda",
    "scrollIndicators": [
      "Hi! I'm Fanda."
    ]
  },
  "cards": [
    {
      "title": "About Me",
      "description": "My name is František Peterka, I'm 23 years old. I am an IT specialist and web application developer."
    },
    {
      "title": "Frontend",
      "description": "I create responsive user interfaces using React and Next.js."
    },
    {
      "title": "Backend",
      "description": "I develop secure and scalable backends using Node.js, Express.js, and MongoDB."
    },
    {
      "title": "Web",
      "description": "I primarily work in the field of web applications."
    },
    {
      "title": "Student",
      "description": "I study software development and enjoy learning new technologies."
    },
    {
      "title": "IT",
      "description": "I have experience in managing Windows systems, network administration, and automation."
    }
  ],
  "contactForm": {
    "labels": {
      "name": "Name",
      "email": "Email",
      "message": "Message"
    },
    "placeholders": {
      "name": "Your name",
      "email": "Your email",
      "message": "Your message"
    },
    "feedback": {
      "success": "Email was sent successfully!",
      "errorPrefix": "Error sending email: "
    }
  },
  "footer": {
    "copyright": "© 2025 František Peterka. All rights reserved."
  },
  "scrollIndicator": {
    "defaultText": "Scroll down"
  },
  "navbar": {
    "brandIcon": "/developer.png",
    "brandText": "Fanda",
    "brandSubText": "JS Developer",
    "separator": ">>>"
  },
  "projects": [
    {
      "name": "List Management App",
      "description": "A comprehensive solution for managing lists and databases. The application offers list management, the ability to create and edit items, filtering, and statistics."
    },
    {
      "name": "PowerShell Scripting",
      "description": "This project utilizes PowerShell scripting for automation."
    },
    {
      "name": "BoostApp",
      "description": "My first web application where I learned the fundamentals of web development."
    }
  ],
  "tech": {
    "0": {
      "title": "CSS",
      "description": "I use advanced CSS techniques (Flexbox, Grid, animations) to create responsive, modern, and aesthetically appealing web designs that ensure a great user experience across devices."
    },
    "1": {
      "title": "Three.js",
      "description": "Using Three.js, I create interactive 3D visualizations and animations directly in the browser, enriching websites with dynamic and engaging 3D elements."
    },
    "2": {
      "title": "Figma",
      "description": "In Figma, I design modern user interfaces and interactive prototypes, support team collaboration, and create visually attractive designs that reflect current UI/UX trends."
    },
    "3": {
      "title": "Git",
      "description": "With Git, I efficiently manage code versions, collaborate in teams, and maintain project history, ensuring smooth development and secure software deployment."
    },
    "4": {
      "title": "HTML",
      "description": "I create semantically correct and accessible web pages using HTML, improving SEO and ensuring a consistent content structure for search engines and users."
    },
    "5": {
      "title": "JavaScript",
      "description": "I use JavaScript to create dynamic and interactive web applications, mastering both basic and advanced concepts for smooth and responsive development."
    },
    "6": {
      "title": "MongoDB",
      "description": "I design flexible and high-performance NoSQL database solutions with MongoDB, enabling efficient management of large data sets and easy scalability of applications."
    },
    "7": {
      "title": "Node.js",
      "description": "With Node.js, I create robust and scalable backends and APIs that support fast communication between client and server and ensure high performance of web applications."
    },
    "8": {
      "title": "React",
      "description": "Using React, I design modern and dynamic frontend applications with a component-based approach, which simplifies state management and the development of interactive user interfaces."
    },
    "9": {
      "title": "PowerShell",
      "description": "I use PowerShell as a scripting tool for automating administrative tasks and system management, especially in Windows environments, significantly streamlining IT infrastructure operations and maintenance."
    },
    "10": {
      "title": "Next.js",
      "description": "Next.js is a React framework that enables server-side rendering and static site generation. With it, I create fast, SEO-optimized web applications with an improved user experience."
    },
    "11": {
      "title": "TypeScript",
      "description": "With TypeScript, I extend JavaScript's capabilities with static typing, increasing code safety, simplifying maintenance, and minimizing runtime errors in applications."
    }
  },
  "experiences": {
    "0": {
      "title": "Unicorn University",
      "name": "Unicorn University",
      "description": "Studying software engineering with a focus on modern web development.",
      "date": "2023 - 2026",
      "skills": [
        "#JavaScript",
        "#TypeScript",
        "#Node.js",
        "#Design",
        "#HTML",
        "#CSS",
        "#React",
        "#SQL",
        "#MongoDB",
        "#NodeRED",
        "#Agile",
        "#Business English"
      ]
    },
    "1": {
      "title": "IT Specialist",
      "name": "IT Specialist",
      "description": "IT Specialist working in a military environment, focused on system and network administration.",
      "date": "2023 - Present",
      "skills": [
        "#Windows",
        "#Network Infrastructure",
        "#Windows Server",
        "#PowerShell",
        "#Simulation",
        "#Remote Management"
      ]
    },
    "2": {
      "title": "Defense University",
      "name": "Defense University",
      "description": "Studied Electrical Engineering (electronics, mathematics, physics). Achieved top results with a GPA equivalent of 4.0 across three semesters. I had to leave in the fourth semester due to health reasons.",
      "date": "2021 - 2023",
      "skills": [
        "#Mathematics",
        "#Physics",
        "#Electrical Engineering"
      ]
    }
  }
}